import React, { useState } from "react";
import Modal from "react-modal";
import { useAppSelector, useAppDispatch } from "@/utilities/hooks";
import { actionReviewForm } from "../../store/actions/modal";
import { useRouter } from "next/router";
import Link from "next/link";
import { axiosQuery } from "@/utilities/utilities";
import { toggle } from "@/store/notificationsSlice";

interface Payload {
  productId: number;
  rating: 1 | 2 | 3 | 4 | 5;
  text?: string;
}

export default function ReviewForm({
  productId,
  onClose,
  onReviewCreated,
}: {
  productId: number;
  onClose: () => void;
  onReviewCreated: () => void;
}) {
  const modalReviewForm = useAppSelector((state) => state.modalReviewForm);

  const [hover, setHover] = useState<1 | 2 | 3 | 4 | 5>(null);
  const [rating, setRating] = useState<1 | 2 | 3 | 4 | 5>(null);
  const [review, setReview] = useState("");

  const dispatch = useAppDispatch();

  const sendReview = async (payload: Payload) => {
    try {
      if (!payload.rating) {
        throw new Error("Поставьте оценку");
      }
      const res = await axiosQuery({ url: `/reviews`, method: "post", payload });
      console.log(res);

      dispatch(toggle({ type: "success", text: "Отзыв опубликован!" }));
      onClose();
      onReviewCreated();
    } catch (e) {
      dispatch(toggle({ type: "error", text: e.message }));
    }
  };

  return (
    <>
      <Modal
        isOpen={modalReviewForm}
        onRequestClose={onClose}
        contentLabel=''
        className='allModal allModal_published d-flex flex-column align-items-center'>
        <button onClick={onClose} className='btn btn_modal-close position-absolute'>
          <svg xmlns='http://www.w3.org/2000/svg' width='16' height='16' viewBox='0 0 16 16' fill='none'>
            <g clipPath='url(#clip0_243_6669)'>
              <path
                d='M15.8045 0.195557C15.6795 0.0705765 15.51 0.000366211 15.3332 0.000366211C15.1564 0.000366211 14.9869 0.0705765 14.8619 0.195557L7.99986 7.05756L1.13786 0.195557C1.01284 0.0705765 0.8433 0.000366211 0.666524 0.000366211C0.489748 0.000366211 0.320209 0.0705765 0.195191 0.195557V0.195557C0.0702103 0.320576 0 0.490114 0 0.666891C0 0.843667 0.0702103 1.01321 0.195191 1.13822L7.05719 8.00022L0.195191 14.8622C0.0702103 14.9872 0 15.1568 0 15.3336C0 15.5103 0.0702103 15.6799 0.195191 15.8049V15.8049C0.320209 15.9299 0.489748 16.0001 0.666524 16.0001C0.8433 16.0001 1.01284 15.9299 1.13786 15.8049L7.99986 8.94289L14.8619 15.8049C14.9869 15.9299 15.1564 16.0001 15.3332 16.0001C15.51 16.0001 15.6795 15.9299 15.8045 15.8049C15.9295 15.6799 15.9997 15.5103 15.9997 15.3336C15.9997 15.1568 15.9295 14.9872 15.8045 14.8622L8.94252 8.00022L15.8045 1.13822C15.9295 1.01321 15.9997 0.843667 15.9997 0.666891C15.9997 0.490114 15.9295 0.320576 15.8045 0.195557V0.195557Z'
                fill='#18130C'
              />
            </g>
            <defs>
              <clipPath id='clip0_243_6669'>
                <rect width='16' height='16' fill='white' />
              </clipPath>
            </defs>
          </svg>
        </button>
        <div className='modal-published-title text-center'>Отзыв</div>
        <div className='modal-published-text w-100 mx-auto'>Поставьте оценку</div>
        <div
          className='buyer-stars'
          style={{ flexDirection: "row", display: "flex", justifyContent: "flex-start", width: "100%", gap: 10, marginBottom: 30 }}>
          <svg width='191' height='31' viewBox='0 0 191 31' fill='none' xmlns='http://www.w3.org/2000/svg'>
            <path
              onClick={() => setRating(1)}
              onMouseEnter={() => setHover(1)}
              onMouseLeave={() => setHover(null)}
              d='M30.5965 11.5055C30.3338 10.642 29.809 9.88863 29.0998 9.35693C28.3905 8.82523 27.5345 8.5434 26.6582 8.55313H21.048L19.344 3.06741C19.076 2.20391 18.5495 1.45063 17.8403 0.916181C17.1311 0.381736 16.2759 0.09375 15.398 0.09375C14.5201 0.09375 13.6649 0.381736 12.9557 0.916181C12.2465 1.45063 11.72 2.20391 11.452 3.06741L9.74802 8.55313H4.13785C3.26434 8.55441 2.41356 8.84079 1.70704 9.37135C1.00052 9.90191 0.474399 10.6495 0.203817 11.5074C-0.0667649 12.3653 -0.0679626 13.2895 0.200395 14.1481C0.468753 15.0067 0.992939 15.7558 1.69808 16.2883L6.26429 19.7368L4.52821 25.2901C4.24765 26.1514 4.2441 27.0833 4.51808 27.9469C4.79206 28.8105 5.3289 29.5594 6.04857 30.0822C6.75591 30.6217 7.61309 30.9107 8.49238 30.9062C9.37167 30.9017 10.226 30.6038 10.9281 30.057L15.398 26.6589L19.8692 30.053C20.5753 30.5894 21.4278 30.8808 22.3043 30.8852C23.1808 30.8896 24.0361 30.6069 24.7471 30.0776C25.4582 29.5482 25.9885 28.7997 26.2617 27.9395C26.535 27.0792 26.5371 26.1517 26.2678 25.2901L24.5317 19.7368L29.1031 16.2883C29.8163 15.7625 30.3466 15.0134 30.6156 14.152C30.8845 13.2906 30.8778 12.3627 30.5965 11.5055Z'
              fill={hover >= 1 || rating >= 1 ? "url(#paint0_linear_611_181)" : "#BDBDBD"}
            />
            <path
              onClick={() => setRating(2)}
              onMouseEnter={() => setHover(2)}
              onMouseLeave={() => setHover(null)}
              d='M68.659 11.5055C68.3963 10.642 67.8715 9.88863 67.1623 9.35693C66.453 8.82523 65.597 8.5434 64.7207 8.55313H59.1105L57.4065 3.06741C57.1385 2.20391 56.612 1.45063 55.9028 0.916181C55.1936 0.381736 54.3384 0.09375 53.4605 0.09375C52.5826 0.09375 51.7274 0.381736 51.0182 0.916181C50.309 1.45063 49.7825 2.20391 49.5145 3.06741L47.8105 8.55313H42.2003C41.3268 8.55441 40.4761 8.84079 39.7695 9.37135C39.063 9.90191 38.5369 10.6495 38.2663 11.5074C37.9957 12.3653 37.9945 13.2895 38.2629 14.1481C38.5313 15.0067 39.0554 15.7558 39.7606 16.2883L44.3268 19.7368L42.5907 25.2901C42.3102 26.1514 42.3066 27.0833 42.5806 27.9469C42.8546 28.8105 43.3914 29.5594 44.1111 30.0822C44.8184 30.6217 45.6756 30.9107 46.5549 30.9062C47.4342 30.9017 48.2885 30.6038 48.9906 30.057L53.4605 26.6589L57.9317 30.053C58.6378 30.5894 59.4903 30.8808 60.3668 30.8852C61.2433 30.8896 62.0986 30.6069 62.8096 30.0776C63.5207 29.5482 64.051 28.7997 64.3242 27.9395C64.5975 27.0792 64.5996 26.1517 64.3303 25.2901L62.5942 19.7368L67.1656 16.2883C67.8788 15.7625 68.4091 15.0134 68.6781 14.152C68.947 13.2906 68.9403 12.3627 68.659 11.5055Z'
              fill={hover >= 2 || rating >= 2 ? "url(#paint1_linear_611_181)" : "#BDBDBD"}
            />
            <path
              onClick={() => setRating(3)}
              onMouseEnter={() => setHover(3)}
              onMouseLeave={() => setHover(null)}
              d='M106.721 11.5055C106.459 10.642 105.934 9.88863 105.225 9.35693C104.516 8.82523 103.659 8.5434 102.783 8.55313H97.173L95.469 3.06741C95.201 2.20391 94.6745 1.45063 93.9653 0.916181C93.2561 0.381736 92.4009 0.09375 91.523 0.09375C90.6451 0.09375 89.7899 0.381736 89.0807 0.916181C88.3715 1.45063 87.845 2.20391 87.577 3.06741L85.873 8.55313H80.2628C79.3893 8.55441 78.5386 8.84079 77.832 9.37135C77.1255 9.90191 76.5994 10.6495 76.3288 11.5074C76.0582 12.3653 76.057 13.2895 76.3254 14.1481C76.5938 15.0067 77.1179 15.7558 77.8231 16.2883L82.3893 19.7368L80.6532 25.2901C80.3727 26.1514 80.3691 27.0833 80.6431 27.9469C80.9171 28.8105 81.4539 29.5594 82.1736 30.0822C82.8809 30.6217 83.7381 30.9107 84.6174 30.9062C85.4967 30.9017 86.351 30.6038 87.0531 30.057L91.523 26.6589L95.9942 30.053C96.7003 30.5894 97.5528 30.8808 98.4293 30.8852C99.3058 30.8896 100.161 30.6069 100.872 30.0776C101.583 29.5482 102.114 28.7997 102.387 27.9395C102.66 27.0792 102.662 26.1517 102.393 25.2901L100.657 19.7368L105.228 16.2883C105.941 15.7625 106.472 15.0134 106.741 14.152C107.01 13.2906 107.003 12.3627 106.721 11.5055Z'
              fill={hover >= 3 || rating >= 3 ? "url(#paint2_linear_611_181)" : "#BDBDBD"}
            />
            <path
              onClick={() => setRating(4)}
              onMouseEnter={() => setHover(4)}
              onMouseLeave={() => setHover(null)}
              d='M144.784 11.5055C144.521 10.642 143.997 9.88863 143.287 9.35693C142.578 8.82523 141.722 8.5434 140.846 8.55313H135.235L133.532 3.06741C133.264 2.20391 132.737 1.45063 132.028 0.916181C131.319 0.381736 130.463 0.09375 129.586 0.09375C128.708 0.09375 127.852 0.381736 127.143 0.916181C126.434 1.45063 125.907 2.20391 125.64 3.06741L123.936 8.55313H118.325C117.452 8.55441 116.601 8.84079 115.895 9.37135C115.188 9.90191 114.662 10.6495 114.391 11.5074C114.121 12.3653 114.12 13.2895 114.388 14.1481C114.656 15.0067 115.18 15.7558 115.886 16.2883L120.452 19.7368L118.716 25.2901C118.435 26.1514 118.432 27.0833 118.706 27.9469C118.98 28.8105 119.516 29.5594 120.236 30.0822C120.943 30.6217 121.801 30.9107 122.68 30.9062C123.559 30.9017 124.414 30.6038 125.116 30.057L129.586 26.6589L134.057 30.053C134.763 30.5894 135.615 30.8808 136.492 30.8852C137.368 30.8896 138.224 30.6069 138.935 30.0776C139.646 29.5482 140.176 28.7997 140.449 27.9395C140.722 27.0792 140.725 26.1517 140.455 25.2901L138.719 19.7368L143.291 16.2883C144.004 15.7625 144.534 15.0134 144.803 14.152C145.072 13.2906 145.065 12.3627 144.784 11.5055Z'
              fill={hover >= 4 || rating >= 4 ? "url(#paint3_linear_611_181)" : "#BDBDBD"}
            />
            <path
              onClick={() => setRating(5)}
              onMouseEnter={() => setHover(5)}
              onMouseLeave={() => setHover(null)}
              d='M182.846 11.5055C182.584 10.642 182.059 9.88863 181.35 9.35693C180.641 8.82523 179.784 8.5434 178.908 8.55313H173.298L171.594 3.06741C171.326 2.20391 170.799 1.45063 170.09 0.916181C169.381 0.381736 168.526 0.09375 167.648 0.09375C166.77 0.09375 165.915 0.381736 165.206 0.916181C164.497 1.45063 163.97 2.20391 163.702 3.06741L161.998 8.55313H156.388C155.514 8.55441 154.664 8.84079 153.957 9.37135C153.251 9.90191 152.724 10.6495 152.454 11.5074C152.183 12.3653 152.182 13.2895 152.45 14.1481C152.719 15.0067 153.243 15.7558 153.948 16.2883L158.514 19.7368L156.778 25.2901C156.498 26.1514 156.494 27.0833 156.768 27.9469C157.042 28.8105 157.579 29.5594 158.299 30.0822C159.006 30.6217 159.863 30.9107 160.742 30.9062C161.622 30.9017 162.476 30.6038 163.178 30.057L167.648 26.6589L172.119 30.053C172.825 30.5894 173.678 30.8808 174.554 30.8852C175.431 30.8896 176.286 30.6069 176.997 30.0776C177.708 29.5482 178.239 28.7997 178.512 27.9395C178.785 27.0792 178.787 26.1517 178.518 25.2901L176.782 19.7368L181.353 16.2883C182.066 15.7625 182.597 15.0134 182.866 14.152C183.135 13.2906 183.128 12.3627 182.846 11.5055Z'
              fill={hover >= 5 || rating >= 5 ? "url(#paint4_linear_611_181)" : "#BDBDBD"}
            />
            <defs>
              <linearGradient id='paint0_linear_611_181' x1='15.4062' y1='0.09375' x2='36.7987' y2='5.04569' gradientUnits='userSpaceOnUse'>
                <stop stop-color='#FE6546' />
                <stop offset='1' stop-color='#FF9E0D' />
              </linearGradient>
              <linearGradient id='paint1_linear_611_181' x1='53.4688' y1='0.09375' x2='74.8612' y2='5.04569' gradientUnits='userSpaceOnUse'>
                <stop stop-color='#FE6546' />
                <stop offset='1' stop-color='#FF9E0D' />
              </linearGradient>
              <linearGradient id='paint2_linear_611_181' x1='91.5312' y1='0.09375' x2='112.924' y2='5.04569' gradientUnits='userSpaceOnUse'>
                <stop stop-color='#FE6546' />
                <stop offset='1' stop-color='#FF9E0D' />
              </linearGradient>
              <linearGradient id='paint3_linear_611_181' x1='129.594' y1='0.09375' x2='150.986' y2='5.04569' gradientUnits='userSpaceOnUse'>
                <stop stop-color='#FE6546' />
                <stop offset='1' stop-color='#FF9E0D' />
              </linearGradient>
              <linearGradient id='paint4_linear_611_181' x1='167.656' y1='0.09375' x2='189.049' y2='5.04569' gradientUnits='userSpaceOnUse'>
                <stop stop-color='#FE6546' />
                <stop offset='1' stop-color='#FF9E0D' />
              </linearGradient>
            </defs>
          </svg>
        </div>
        <textarea
          value={review}
          onChange={(e) => setReview(e.target.value)}
          maxLength={1000}
          style={{ width: "100%", height: 230, borderRadius: 16, border: "1px solid #18130C", padding: "14px 20px", marginBottom: 14 }}
          placeholder='Комментарий'
        />
        <div className='modal-published-text w-100 mx-auto'>Не более 1000 символов, включая пробелы.</div>

        <button
          onClick={() => sendReview({ text: review || void 0, rating, productId })}
          className='btn btn_submit btn_submit-green'
          style={{
            backgroundImage: "linear-gradient(103deg, #fe6546 40.6%, #ff9e0d 100%)",
            color: "#fff",
            boxShadow: "0px 4px 4px 0px rgba(0, 0, 0, 0.25)",
          }}>
          Оставить отзыв
        </button>
      </Modal>
    </>
  );
}
